load/results/20260504-222851-nominal/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/paymei/Documents/Development/github/meyouquize/load/k6-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 35 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 35 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 35/35 VUs, 896 complete and 0 interrupted iterations
default   [   1% ] 35 VUs  0m01.0s/3m0s

running (0m02.0s), 35/35 VUs, 2083 complete and 0 interrupted iterations
default   [   1% ] 35 VUs  0m02.0s/3m0s

running (0m03.0s), 35/35 VUs, 3243 complete and 0 interrupted iterations
default   [   2% ] 35 VUs  0m03.0s/3m0s

running (0m04.0s), 35/35 VUs, 4272 complete and 0 interrupted iterations
default   [   2% ] 35 VUs  0m04.0s/3m0s

running (0m05.0s), 35/35 VUs, 5373 complete and 0 interrupted iterations
default   [   3% ] 35 VUs  0m05.0s/3m0s

running (0m06.0s), 35/35 VUs, 6308 complete and 0 interrupted iterations
default   [   3% ] 35 VUs  0m06.0s/3m0s

running (0m07.0s), 35/35 VUs, 7444 complete and 0 interrupted iterations
default   [   4% ] 35 VUs  0m07.0s/3m0s

running (0m08.0s), 35/35 VUs, 8576 complete and 0 interrupted iterations
default   [   4% ] 35 VUs  0m08.0s/3m0s

running (0m09.0s), 35/35 VUs, 9714 complete and 0 interrupted iterations
default   [   5% ] 35 VUs  0m09.0s/3m0s

running (0m10.0s), 35/35 VUs, 10797 complete and 0 interrupted iterations
default   [   6% ] 35 VUs  0m10.0s/3m0s

running (0m11.0s), 35/35 VUs, 11942 complete and 0 interrupted iterations
default   [   6% ] 35 VUs  0m11.0s/3m0s

running (0m12.0s), 35/35 VUs, 13059 complete and 0 interrupted iterations
default   [   7% ] 35 VUs  0m12.0s/3m0s

running (0m13.0s), 35/35 VUs, 14237 complete and 0 interrupted iterations
default   [   7% ] 35 VUs  0m13.0s/3m0s

running (0m14.0s), 35/35 VUs, 15345 complete and 0 interrupted iterations
default   [   8% ] 35 VUs  0m14.0s/3m0s

running (0m15.0s), 35/35 VUs, 16655 complete and 0 interrupted iterations
default   [   8% ] 35 VUs  0m15.0s/3m0s

running (0m16.0s), 35/35 VUs, 17844 complete and 0 interrupted iterations
default   [   9% ] 35 VUs  0m16.0s/3m0s

running (0m17.0s), 35/35 VUs, 19102 complete and 0 interrupted iterations
default   [   9% ] 35 VUs  0m17.0s/3m0s

running (0m18.0s), 35/35 VUs, 20298 complete and 0 interrupted iterations
default   [  10% ] 35 VUs  0m18.0s/3m0s

running (0m19.0s), 35/35 VUs, 21522 complete and 0 interrupted iterations
default   [  11% ] 35 VUs  0m19.0s/3m0s

running (0m20.0s), 35/35 VUs, 22813 complete and 0 interrupted iterations
default   [  11% ] 35 VUs  0m20.0s/3m0s

running (0m21.0s), 35/35 VUs, 24022 complete and 0 interrupted iterations
default   [  12% ] 35 VUs  0m21.0s/3m0s

running (0m22.0s), 35/35 VUs, 25310 complete and 0 interrupted iterations
default   [  12% ] 35 VUs  0m22.0s/3m0s

running (0m23.0s), 35/35 VUs, 26555 complete and 0 interrupted iterations
default   [  13% ] 35 VUs  0m23.0s/3m0s

running (0m24.0s), 35/35 VUs, 27838 complete and 0 interrupted iterations
default   [  13% ] 35 VUs  0m24.0s/3m0s

running (0m25.0s), 35/35 VUs, 28994 complete and 0 interrupted iterations
default   [  14% ] 35 VUs  0m25.0s/3m0s

running (0m26.0s), 35/35 VUs, 30181 complete and 0 interrupted iterations
default   [  14% ] 35 VUs  0m26.0s/3m0s

running (0m27.0s), 35/35 VUs, 31394 complete and 0 interrupted iterations
default   [  15% ] 35 VUs  0m27.0s/3m0s

running (0m28.0s), 35/35 VUs, 32625 complete and 0 interrupted iterations
default   [  16% ] 35 VUs  0m28.0s/3m0s

running (0m29.0s), 35/35 VUs, 33700 complete and 0 interrupted iterations
default   [  16% ] 35 VUs  0m29.0s/3m0s

running (0m30.0s), 35/35 VUs, 34834 complete and 0 interrupted iterations
default   [  17% ] 35 VUs  0m30.0s/3m0s

running (0m31.0s), 35/35 VUs, 36002 complete and 0 interrupted iterations
default   [  17% ] 35 VUs  0m31.0s/3m0s

running (0m32.0s), 35/35 VUs, 37145 complete and 0 interrupted iterations
default   [  18% ] 35 VUs  0m32.0s/3m0s

running (0m33.0s), 35/35 VUs, 38217 complete and 0 interrupted iterations
default   [  18% ] 35 VUs  0m33.0s/3m0s

running (0m34.0s), 35/35 VUs, 39435 complete and 0 interrupted iterations
default   [  19% ] 35 VUs  0m34.0s/3m0s

running (0m35.0s), 35/35 VUs, 40593 complete and 0 interrupted iterations
default   [  19% ] 35 VUs  0m35.0s/3m0s

running (0m36.0s), 35/35 VUs, 41781 complete and 0 interrupted iterations
default   [  20% ] 35 VUs  0m36.0s/3m0s

running (0m37.0s), 35/35 VUs, 42942 complete and 0 interrupted iterations
default   [  21% ] 35 VUs  0m37.0s/3m0s

running (0m38.0s), 35/35 VUs, 44154 complete and 0 interrupted iterations
default   [  21% ] 35 VUs  0m38.0s/3m0s

running (0m39.0s), 35/35 VUs, 45298 complete and 0 interrupted iterations
default   [  22% ] 35 VUs  0m39.0s/3m0s

running (0m40.0s), 35/35 VUs, 46544 complete and 0 interrupted iterations
default   [  22% ] 35 VUs  0m40.0s/3m0s

running (0m41.0s), 35/35 VUs, 47701 complete and 0 interrupted iterations
default   [  23% ] 35 VUs  0m41.0s/3m0s

running (0m42.0s), 35/35 VUs, 48817 complete and 0 interrupted iterations
default   [  23% ] 35 VUs  0m42.0s/3m0s

running (0m43.0s), 35/35 VUs, 49853 complete and 0 interrupted iterations
default   [  24% ] 35 VUs  0m43.0s/3m0s

running (0m44.0s), 35/35 VUs, 50970 complete and 0 interrupted iterations
default   [  24% ] 35 VUs  0m44.0s/3m0s

running (0m45.0s), 35/35 VUs, 52307 complete and 0 interrupted iterations
default   [  25% ] 35 VUs  0m45.0s/3m0s

running (0m46.0s), 35/35 VUs, 53484 complete and 0 interrupted iterations
default   [  26% ] 35 VUs  0m46.0s/3m0s

running (0m47.0s), 35/35 VUs, 54614 complete and 0 interrupted iterations
default   [  26% ] 35 VUs  0m47.0s/3m0s

running (0m48.0s), 35/35 VUs, 55744 complete and 0 interrupted iterations
default   [  27% ] 35 VUs  0m48.0s/3m0s

running (0m49.0s), 35/35 VUs, 56917 complete and 0 interrupted iterations
default   [  27% ] 35 VUs  0m49.0s/3m0s

running (0m50.0s), 35/35 VUs, 58099 complete and 0 interrupted iterations
default   [  28% ] 35 VUs  0m50.0s/3m0s

running (0m51.0s), 35/35 VUs, 59259 complete and 0 interrupted iterations
default   [  28% ] 35 VUs  0m51.0s/3m0s

running (0m52.0s), 35/35 VUs, 60487 complete and 0 interrupted iterations
default   [  29% ] 35 VUs  0m52.0s/3m0s

running (0m53.0s), 35/35 VUs, 61669 complete and 0 interrupted iterations
default   [  29% ] 35 VUs  0m53.0s/3m0s

running (0m54.0s), 35/35 VUs, 62876 complete and 0 interrupted iterations
default   [  30% ] 35 VUs  0m54.0s/3m0s

running (0m55.0s), 35/35 VUs, 64000 complete and 0 interrupted iterations
default   [  31% ] 35 VUs  0m55.0s/3m0s

running (0m56.0s), 35/35 VUs, 65146 complete and 0 interrupted iterations
default   [  31% ] 35 VUs  0m56.0s/3m0s

running (0m57.0s), 35/35 VUs, 66312 complete and 0 interrupted iterations
default   [  32% ] 35 VUs  0m57.0s/3m0s

running (0m58.0s), 35/35 VUs, 67475 complete and 0 interrupted iterations
default   [  32% ] 35 VUs  0m58.0s/3m0s

running (0m59.0s), 35/35 VUs, 68612 complete and 0 interrupted iterations
default   [  33% ] 35 VUs  0m59.0s/3m0s

running (1m00.0s), 35/35 VUs, 69771 complete and 0 interrupted iterations
default   [  33% ] 35 VUs  1m00.0s/3m0s

running (1m01.0s), 35/35 VUs, 70878 complete and 0 interrupted iterations
default   [  34% ] 35 VUs  1m01.0s/3m0s

running (1m02.0s), 35/35 VUs, 72117 complete and 0 interrupted iterations
default   [  34% ] 35 VUs  1m02.0s/3m0s

running (1m03.0s), 35/35 VUs, 73394 complete and 0 interrupted iterations
default   [  35% ] 35 VUs  1m03.0s/3m0s

running (1m04.0s), 35/35 VUs, 74594 complete and 0 interrupted iterations
default   [  36% ] 35 VUs  1m04.0s/3m0s

running (1m05.0s), 35/35 VUs, 75794 complete and 0 interrupted iterations
default   [  36% ] 35 VUs  1m05.0s/3m0s

running (1m06.0s), 35/35 VUs, 77068 complete and 0 interrupted iterations
default   [  37% ] 35 VUs  1m06.0s/3m0s

running (1m07.0s), 35/35 VUs, 78277 complete and 0 interrupted iterations
default   [  37% ] 35 VUs  1m07.0s/3m0s

running (1m08.0s), 35/35 VUs, 79420 complete and 0 interrupted iterations
default   [  38% ] 35 VUs  1m08.0s/3m0s

running (1m09.0s), 35/35 VUs, 80509 complete and 0 interrupted iterations
default   [  38% ] 35 VUs  1m09.0s/3m0s

running (1m10.0s), 35/35 VUs, 81707 complete and 0 interrupted iterations
default   [  39% ] 35 VUs  1m10.0s/3m0s

running (1m11.0s), 35/35 VUs, 82902 complete and 0 interrupted iterations
default   [  39% ] 35 VUs  1m11.0s/3m0s

running (1m12.0s), 35/35 VUs, 84108 complete and 0 interrupted iterations
default   [  40% ] 35 VUs  1m12.0s/3m0s

running (1m13.0s), 35/35 VUs, 85200 complete and 0 interrupted iterations
default   [  41% ] 35 VUs  1m13.0s/3m0s

running (1m14.0s), 35/35 VUs, 86375 complete and 0 interrupted iterations
default   [  41% ] 35 VUs  1m14.0s/3m0s

running (1m15.0s), 35/35 VUs, 87497 complete and 0 interrupted iterations
default   [  42% ] 35 VUs  1m15.0s/3m0s

running (1m16.0s), 35/35 VUs, 88767 complete and 0 interrupted iterations
default   [  42% ] 35 VUs  1m16.0s/3m0s

running (1m17.0s), 35/35 VUs, 90022 complete and 0 interrupted iterations
default   [  43% ] 35 VUs  1m17.0s/3m0s

running (1m18.0s), 35/35 VUs, 91218 complete and 0 interrupted iterations
default   [  43% ] 35 VUs  1m18.0s/3m0s

running (1m19.0s), 35/35 VUs, 92435 complete and 0 interrupted iterations
default   [  44% ] 35 VUs  1m19.0s/3m0s

running (1m20.0s), 35/35 VUs, 93625 complete and 0 interrupted iterations
default   [  44% ] 35 VUs  1m20.0s/3m0s

running (1m21.0s), 35/35 VUs, 94889 complete and 0 interrupted iterations
default   [  45% ] 35 VUs  1m21.0s/3m0s

running (1m22.0s), 35/35 VUs, 96033 complete and 0 interrupted iterations
default   [  46% ] 35 VUs  1m22.0s/3m0s

running (1m23.0s), 35/35 VUs, 97182 complete and 0 interrupted iterations
default   [  46% ] 35 VUs  1m23.0s/3m0s

running (1m24.0s), 35/35 VUs, 98318 complete and 0 interrupted iterations
default   [  47% ] 35 VUs  1m24.0s/3m0s

running (1m25.0s), 35/35 VUs, 99491 complete and 0 interrupted iterations
default   [  47% ] 35 VUs  1m25.0s/3m0s

running (1m26.0s), 35/35 VUs, 100690 complete and 0 interrupted iterations
default   [  48% ] 35 VUs  1m26.0s/3m0s

running (1m27.0s), 35/35 VUs, 101933 complete and 0 interrupted iterations
default   [  48% ] 35 VUs  1m27.0s/3m0s

running (1m28.0s), 35/35 VUs, 103184 complete and 0 interrupted iterations
default   [  49% ] 35 VUs  1m28.0s/3m0s

running (1m29.0s), 35/35 VUs, 104299 complete and 0 interrupted iterations
default   [  49% ] 35 VUs  1m29.0s/3m0s

running (1m30.0s), 35/35 VUs, 105529 complete and 0 interrupted iterations
default   [  50% ] 35 VUs  1m30.0s/3m0s

running (1m31.0s), 35/35 VUs, 106672 complete and 0 interrupted iterations
default   [  51% ] 35 VUs  1m31.0s/3m0s

running (1m32.0s), 35/35 VUs, 107831 complete and 0 interrupted iterations
default   [  51% ] 35 VUs  1m32.0s/3m0s

running (1m33.0s), 35/35 VUs, 109017 complete and 0 interrupted iterations
default   [  52% ] 35 VUs  1m33.0s/3m0s

running (1m34.0s), 35/35 VUs, 110115 complete and 0 interrupted iterations
default   [  52% ] 35 VUs  1m34.0s/3m0s

running (1m35.0s), 35/35 VUs, 111223 complete and 0 interrupted iterations
default   [  53% ] 35 VUs  1m35.0s/3m0s

running (1m36.0s), 35/35 VUs, 112422 complete and 0 interrupted iterations
default   [  53% ] 35 VUs  1m36.0s/3m0s

running (1m37.0s), 35/35 VUs, 113582 complete and 0 interrupted iterations
default   [  54% ] 35 VUs  1m37.0s/3m0s

running (1m38.0s), 35/35 VUs, 114670 complete and 0 interrupted iterations
default   [  54% ] 35 VUs  1m38.0s/3m0s

running (1m39.0s), 35/35 VUs, 115801 complete and 0 interrupted iterations
default   [  55% ] 35 VUs  1m39.0s/3m0s

running (1m40.0s), 35/35 VUs, 116962 complete and 0 interrupted iterations
default   [  56% ] 35 VUs  1m40.0s/3m0s

running (1m41.0s), 35/35 VUs, 118130 complete and 0 interrupted iterations
default   [  56% ] 35 VUs  1m41.0s/3m0s

running (1m42.0s), 35/35 VUs, 119240 complete and 0 interrupted iterations
default   [  57% ] 35 VUs  1m42.0s/3m0s

running (1m43.0s), 35/35 VUs, 120416 complete and 0 interrupted iterations
default   [  57% ] 35 VUs  1m43.0s/3m0s

running (1m44.0s), 35/35 VUs, 121580 complete and 0 interrupted iterations
default   [  58% ] 35 VUs  1m44.0s/3m0s

running (1m45.0s), 35/35 VUs, 122735 complete and 0 interrupted iterations
default   [  58% ] 35 VUs  1m45.0s/3m0s

running (1m46.0s), 35/35 VUs, 123858 complete and 0 interrupted iterations
default   [  59% ] 35 VUs  1m46.0s/3m0s

running (1m47.0s), 35/35 VUs, 124997 complete and 0 interrupted iterations
default   [  59% ] 35 VUs  1m47.0s/3m0s

running (1m48.0s), 35/35 VUs, 126020 complete and 0 interrupted iterations
default   [  60% ] 35 VUs  1m48.0s/3m0s

running (1m49.0s), 35/35 VUs, 127147 complete and 0 interrupted iterations
default   [  61% ] 35 VUs  1m49.0s/3m0s

running (1m50.0s), 35/35 VUs, 128328 complete and 0 interrupted iterations
default   [  61% ] 35 VUs  1m50.0s/3m0s

running (1m51.0s), 35/35 VUs, 129414 complete and 0 interrupted iterations
default   [  62% ] 35 VUs  1m51.0s/3m0s

running (1m52.0s), 35/35 VUs, 130623 complete and 0 interrupted iterations
default   [  62% ] 35 VUs  1m52.0s/3m0s

running (1m53.0s), 35/35 VUs, 131737 complete and 0 interrupted iterations
default   [  63% ] 35 VUs  1m53.0s/3m0s

running (1m54.0s), 35/35 VUs, 133000 complete and 0 interrupted iterations
default   [  63% ] 35 VUs  1m54.0s/3m0s

running (1m55.0s), 35/35 VUs, 134035 complete and 0 interrupted iterations
default   [  64% ] 35 VUs  1m55.0s/3m0s

running (1m56.0s), 35/35 VUs, 135181 complete and 0 interrupted iterations
default   [  64% ] 35 VUs  1m56.0s/3m0s

running (1m57.0s), 35/35 VUs, 136287 complete and 0 interrupted iterations
default   [  65% ] 35 VUs  1m57.0s/3m0s

running (1m58.0s), 35/35 VUs, 137344 complete and 0 interrupted iterations
default   [  66% ] 35 VUs  1m58.0s/3m0s

running (1m59.0s), 35/35 VUs, 138533 complete and 0 interrupted iterations
default   [  66% ] 35 VUs  1m59.0s/3m0s

running (2m00.0s), 35/35 VUs, 139690 complete and 0 interrupted iterations
default   [  67% ] 35 VUs  2m00.0s/3m0s

running (2m01.0s), 35/35 VUs, 140867 complete and 0 interrupted iterations
default   [  67% ] 35 VUs  2m01.0s/3m0s

running (2m02.0s), 35/35 VUs, 142009 complete and 0 interrupted iterations
default   [  68% ] 35 VUs  2m02.0s/3m0s

running (2m03.0s), 35/35 VUs, 143175 complete and 0 interrupted iterations
default   [  68% ] 35 VUs  2m03.0s/3m0s

running (2m04.0s), 35/35 VUs, 144306 complete and 0 interrupted iterations
default   [  69% ] 35 VUs  2m04.0s/3m0s

running (2m05.0s), 35/35 VUs, 145449 complete and 0 interrupted iterations
default   [  69% ] 35 VUs  2m05.0s/3m0s

running (2m06.0s), 35/35 VUs, 146603 complete and 0 interrupted iterations
default   [  70% ] 35 VUs  2m06.0s/3m0s

running (2m07.0s), 35/35 VUs, 147692 complete and 0 interrupted iterations
default   [  71% ] 35 VUs  2m07.0s/3m0s

running (2m08.0s), 35/35 VUs, 148965 complete and 0 interrupted iterations
default   [  71% ] 35 VUs  2m08.0s/3m0s

running (2m09.0s), 35/35 VUs, 150226 complete and 0 interrupted iterations
default   [  72% ] 35 VUs  2m09.0s/3m0s

running (2m10.0s), 35/35 VUs, 151313 complete and 0 interrupted iterations
default   [  72% ] 35 VUs  2m10.0s/3m0s

running (2m11.0s), 35/35 VUs, 152522 complete and 0 interrupted iterations
default   [  73% ] 35 VUs  2m11.0s/3m0s

running (2m12.0s), 35/35 VUs, 153697 complete and 0 interrupted iterations
default   [  73% ] 35 VUs  2m12.0s/3m0s

running (2m13.0s), 35/35 VUs, 154906 complete and 0 interrupted iterations
default   [  74% ] 35 VUs  2m13.0s/3m0s

running (2m14.0s), 35/35 VUs, 156101 complete and 0 interrupted iterations
default   [  74% ] 35 VUs  2m14.0s/3m0s

running (2m15.0s), 35/35 VUs, 157289 complete and 0 interrupted iterations
default   [  75% ] 35 VUs  2m15.0s/3m0s

running (2m16.0s), 35/35 VUs, 158506 complete and 0 interrupted iterations
default   [  76% ] 35 VUs  2m16.0s/3m0s

running (2m17.0s), 35/35 VUs, 159654 complete and 0 interrupted iterations
default   [  76% ] 35 VUs  2m17.0s/3m0s

running (2m18.0s), 35/35 VUs, 160886 complete and 0 interrupted iterations
default   [  77% ] 35 VUs  2m18.0s/3m0s

running (2m19.0s), 35/35 VUs, 162095 complete and 0 interrupted iterations
default   [  77% ] 35 VUs  2m19.0s/3m0s

running (2m20.0s), 35/35 VUs, 163290 complete and 0 interrupted iterations
default   [  78% ] 35 VUs  2m20.0s/3m0s

running (2m21.0s), 35/35 VUs, 164515 complete and 0 interrupted iterations
default   [  78% ] 35 VUs  2m21.0s/3m0s

running (2m22.0s), 35/35 VUs, 165708 complete and 0 interrupted iterations
default   [  79% ] 35 VUs  2m22.0s/3m0s

running (2m23.0s), 35/35 VUs, 166986 complete and 0 interrupted iterations
default   [  79% ] 35 VUs  2m23.0s/3m0s

running (2m24.0s), 35/35 VUs, 168180 complete and 0 interrupted iterations
default   [  80% ] 35 VUs  2m24.0s/3m0s

running (2m25.0s), 35/35 VUs, 169400 complete and 0 interrupted iterations
default   [  81% ] 35 VUs  2m25.0s/3m0s

running (2m26.0s), 35/35 VUs, 170578 complete and 0 interrupted iterations
default   [  81% ] 35 VUs  2m26.0s/3m0s

running (2m27.0s), 35/35 VUs, 171785 complete and 0 interrupted iterations
default   [  82% ] 35 VUs  2m27.0s/3m0s

running (2m28.0s), 35/35 VUs, 173015 complete and 0 interrupted iterations
default   [  82% ] 35 VUs  2m28.0s/3m0s

running (2m29.0s), 35/35 VUs, 174181 complete and 0 interrupted iterations
default   [  83% ] 35 VUs  2m29.0s/3m0s

running (2m30.0s), 35/35 VUs, 175306 complete and 0 interrupted iterations
default   [  83% ] 35 VUs  2m30.0s/3m0s

running (2m31.0s), 35/35 VUs, 176479 complete and 0 interrupted iterations
default   [  84% ] 35 VUs  2m31.0s/3m0s

running (2m32.0s), 35/35 VUs, 177671 complete and 0 interrupted iterations
default   [  84% ] 35 VUs  2m32.0s/3m0s

running (2m33.0s), 35/35 VUs, 178907 complete and 0 interrupted iterations
default   [  85% ] 35 VUs  2m33.0s/3m0s

running (2m34.0s), 35/35 VUs, 180012 complete and 0 interrupted iterations
default   [  86% ] 35 VUs  2m34.0s/3m0s

running (2m35.0s), 35/35 VUs, 181205 complete and 0 interrupted iterations
default   [  86% ] 35 VUs  2m35.0s/3m0s

running (2m36.0s), 35/35 VUs, 182423 complete and 0 interrupted iterations
default   [  87% ] 35 VUs  2m36.0s/3m0s

running (2m37.0s), 35/35 VUs, 183541 complete and 0 interrupted iterations
default   [  87% ] 35 VUs  2m37.0s/3m0s

running (2m38.0s), 35/35 VUs, 184827 complete and 0 interrupted iterations
default   [  88% ] 35 VUs  2m38.0s/3m0s

running (2m39.0s), 35/35 VUs, 186043 complete and 0 interrupted iterations
default   [  88% ] 35 VUs  2m39.0s/3m0s

running (2m40.0s), 35/35 VUs, 187262 complete and 0 interrupted iterations
default   [  89% ] 35 VUs  2m40.0s/3m0s

running (2m41.0s), 35/35 VUs, 188447 complete and 0 interrupted iterations
default   [  89% ] 35 VUs  2m41.0s/3m0s

running (2m42.0s), 35/35 VUs, 189665 complete and 0 interrupted iterations
default   [  90% ] 35 VUs  2m42.0s/3m0s

running (2m43.0s), 35/35 VUs, 190780 complete and 0 interrupted iterations
default   [  91% ] 35 VUs  2m43.0s/3m0s

running (2m44.0s), 35/35 VUs, 191958 complete and 0 interrupted iterations
default   [  91% ] 35 VUs  2m44.0s/3m0s

running (2m45.0s), 35/35 VUs, 193166 complete and 0 interrupted iterations
default   [  92% ] 35 VUs  2m45.0s/3m0s

running (2m46.0s), 35/35 VUs, 194450 complete and 0 interrupted iterations
default   [  92% ] 35 VUs  2m46.0s/3m0s

running (2m47.0s), 35/35 VUs, 195613 complete and 0 interrupted iterations
default   [  93% ] 35 VUs  2m47.0s/3m0s

running (2m48.0s), 35/35 VUs, 196750 complete and 0 interrupted iterations
default   [  93% ] 35 VUs  2m48.0s/3m0s

running (2m49.0s), 35/35 VUs, 197935 complete and 0 interrupted iterations
default   [  94% ] 35 VUs  2m49.0s/3m0s

running (2m50.0s), 35/35 VUs, 199126 complete and 0 interrupted iterations
default   [  94% ] 35 VUs  2m50.0s/3m0s

running (2m51.0s), 35/35 VUs, 200157 complete and 0 interrupted iterations
default   [  95% ] 35 VUs  2m51.0s/3m0s

running (2m52.0s), 35/35 VUs, 201344 complete and 0 interrupted iterations
default   [  96% ] 35 VUs  2m52.0s/3m0s

running (2m53.0s), 35/35 VUs, 202488 complete and 0 interrupted iterations
default   [  96% ] 35 VUs  2m53.0s/3m0s

running (2m54.0s), 35/35 VUs, 203608 complete and 0 interrupted iterations
default   [  97% ] 35 VUs  2m54.0s/3m0s

running (2m55.0s), 35/35 VUs, 204725 complete and 0 interrupted iterations
default   [  97% ] 35 VUs  2m55.0s/3m0s

running (2m56.0s), 35/35 VUs, 205931 complete and 0 interrupted iterations
default   [  98% ] 35 VUs  2m56.0s/3m0s

running (2m57.0s), 35/35 VUs, 207054 complete and 0 interrupted iterations
default   [  98% ] 35 VUs  2m57.0s/3m0s

running (2m58.0s), 35/35 VUs, 208288 complete and 0 interrupted iterations
default   [  99% ] 35 VUs  2m58.0s/3m0s

running (2m59.0s), 35/35 VUs, 209519 complete and 0 interrupted iterations
default   [  99% ] 35 VUs  2m59.0s/3m0s

running (3m00.0s), 35/35 VUs, 210772 complete and 0 interrupted iterations
default   [ 100% ] 35 VUs  3m00.0s/3m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=19.91ms
    ✓ 'p(99)<900' p(99)=229.61ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 421654  2339.493267/s
    checks_succeeded...: 100.00% 421654 out of 421654
    checks_failed......: 0.00%   0 out of 421654

    ✓ healthz:200
    ✓ readyz:200

    HTTP
    http_req_duration..............: avg=14.88ms min=5.26ms  med=11.01ms max=878.74ms p(90)=16.07ms p(95)=19.91ms
      { expected_response:true }...: avg=14.88ms min=5.26ms  med=11.01ms max=878.74ms p(90)=16.07ms p(95)=19.91ms
    http_req_failed................: 0.00%  0 out of 421654
    http_reqs......................: 421654 2339.493267/s

    EXECUTION
    iteration_duration.............: avg=29.87ms min=12.06ms med=22.58ms max=887.63ms p(90)=32.06ms p(95)=38.56ms
    iterations.....................: 210827 1169.746634/s
    vus............................: 35     min=35          max=35
    vus_max........................: 35     min=35          max=35

    NETWORK
    data_received..................: 197 MB 1.1 MB/s
    data_sent......................: 17 MB  92 kB/s



running (3m00.2s), 00/35 VUs, 210827 complete and 0 interrupted iterations
default ✓ [ 100% ] 35 VUs  3m0s